routes/web.php

    Route::resource('/spk', PutusanController::class)->only('index');
});

Route::get('/form', function () {
    $data = [
        'identifikasi' => Identifikasi::all(),
        'kondisi_user' => KondisiUser::all(),
    ];
    return view('form', $data);
});
---
SELECT * FROM `kondisi_users`