app/Http/Controllers/DiagnosaController.php

SELECT * FROM `tingkat_penyakit`
SELECT * FROM `keputusan` WHERE `kode_gejala` in ('G010', 'G023') and `kode_penyakit` = 'P001'
---
    public function store(StoreDiagnosaRequest $request)
    {
        $filteredArray = $request->post('kondisi');
        $kondisi = array_filter($filteredArray, function ($value) {
            return $value !== null;
        });

        // dd($kondisi);
        $kodeGejala = [];
        $bobotPilihan = [];
        foreach ($kondisi as $key => $val) {
            if ($val != "#") {
                echo "key : $key, val : $val";
                echo "<br>";
                array_push($kodeGejala, $key);
                array_push($bobotPilihan, array($key, $val));
            }
        }

        $penyakit = TingkatPenyakit::all();
        $cf = 0;
        // penyakit
        $arrGejala = [];
        for ($i = 0; $i < count($penyakit); $i++) {
            $cfArr = [
                "cf" => [],
                "kode_penyakit" => []
            ];
            $ruleSetiapPenyakit = Keputusan::whereIn("kode_gejala", $kodeGejala)->where("kode_penyakit", $penyakit[$i]->kode_penyakit)->get();

INSERT INTO `diagnosas` (`diagnosa_id`, `data_diagnosa`, `kondisi`, `updated_at`, `created_at`) VALUES ('658fc3e02dc18', '[{\"value\":\"0.8\",\"kode_penyakit\":\"P002\"},{\"value\":\"1\",\"kode_penyakit\":\"P005\"}]', '[[\"G010\",\"0.8\"],[\"G023\",\"1\"]]', '2023-12-30 14:16:48', '2023-12-30 14:16:48')
---
        // echo "<br>";

        $diagnosa_id = uniqid();
        $ins =  Diagnosa::create([
            'diagnosa_id' => strval($diagnosa_id),
            'data_diagnosa' => json_encode($arrGejala),
            'kondisi' => json_encode($bobotPilihan)
        ]);

SELECT * FROM `diagnosas` WHERE `diagnosa_id` = '658fc3e02dc18' LIMIT 1
SELECT * FROM `tingkat_penyakit` WHERE `kode_penyakit` = 'P002' LIMIT 1
SELECT * FROM `keputusan` WHERE `kode_gejala` in ('G010', 'G023') and `kode_penyakit` = 'P005'
---
    public function diagnosaResult($diagnosa_id)
    {
        $diagnosa = Diagnosa::where('diagnosa_id', $diagnosa_id)->first();
        $gejala = json_decode($diagnosa->kondisi, true);
        $data_diagnosa = json_decode($diagnosa->data_diagnosa, true);
        // dd($data_diagnosa);
        $int = 0.0;
        $diagnosa_dipilih = [];
        foreach ($data_diagnosa as $val) {
            // print_r(floatval($val["value"]));
            if (floatval($val["value"]) > $int) {
                $diagnosa_dipilih["value"] = floatval($val["value"]);
                $diagnosa_dipilih["kode_penyakit"] = TingkatPenyakit::where("kode_penyakit", $val["kode_penyakit"])->first();
                $int = floatval($val["value"]);
            }
        }
        // dd($diagnosa_dipilih);
        // dd($gejala);

        $kodeGejala = [];
        foreach ($gejala as $key) {
            array_push($kodeGejala, $key[0]);
        }
        // dd($kodeGejala);
        $kode_penyakit = $diagnosa_dipilih["kode_penyakit"]->kode_penyakit;
        $pakar = Keputusan::whereIn("kode_gejala", $kodeGejala)->where("kode_penyakit", $kode_penyakit)->get();

SELECT * FROM `artikels` WHERE `kode_penyakit` = 'P005' LIMIT 1
---
        $hasil = $this->getGabunganCf($cfKombinasi);
        // dd($hasil);

        $artikel = Artikel::where('kode_penyakit', $kode_penyakit)->first();